{
  "session_info": {
    "filename": "public/Continuous_2025_09_01.json",
    "created_at": "2025-09-01T03:48:56.566904",
    "total_articles": 10,
    "new_articles_in_last_fetch": 10,
    "sources": [
      "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114"
    ],
    "continuous_interval": "5 minutes"
  },
  "articles": [
    {
      "title": "OpenAI's Brad Lightcap leads global expansion, pursuit of enterprise",
      "link": "https://www.cnbc.com/2025/08/31/openais-brad-lightcap-leads-global-expansion-pursuit-of-enterprise.html",
      "summary": "OpenAI is expanding globally and building an enterprise business that’s fueling tension with its biggest backer and cloud partner, Microsoft.",
      "published": "Sun, 31 Aug 2025 12:00:01 GMT",
      "content": "Sam Altmanneeded someone to manage the finances. It was 2018, and OpenAI was still a nonprofit research outfit with 40 employees, no consumer product and no clear revenue model. But someone had to oversee the money. Altman asked Brad Lightcap, who he'd worked with at startup accelerator Y Combinator, to help him with the search. Lightcap interviewed more than 20 people. Nobody wanted the job. So Lightcap decided to do it himself, stepping into a temporary role as the first business hire inside what was still unmistakably a lab. \"We had no idea we were going to make a chatbot that a lot of people were going to talk to,\" Altman said at a dinner with reporters earlier this month in San Francisco that Lightcap also attended. \"That was just not in the conception.\" Seven years after joining the nascent startup, Lightcap is operating chief of a $500 billion startup with 3,000 employees. His task is to turnOpenAI from a consumer phenomenon, known for creating ChatGPT and sparking the generative AI boom, into a force in the enterprise. The company took a major step in that direction this week, announcing new offices in Brazil, Australia, and India in response to business demand. As it enters new markets, Lightcap doesn't have to worry about building a brand. ChatGPT now boasts more than 700 million weekly active users less than three years into its existence. But selling into the enterprise requires bodies. In the past 18 months, Lightcap has built OpenAI's go-to-market team from around 50 people to more than 700, which includes sales reps and staffers focused on customer success, developer relations and strategic partnerships. The push started in 2023, with GPT-4 and the launch of ChatGPT Enterprise. Businesses could suddenly see that OpenAI's large language models were capable of reliably handling workflow tasks. Clients started coming in from every direction. \"It was the first time you cross the chasm of the models being intelligent enough to actually solve problems for businesses,\" Lightcap, 34, said in an interview this week. \"We saw significant demand coming out of that launch.\" Modernabeganusing ChatGPT Enterpriseto accelerate drug discovery and summarize vast amounts of research data.Uberbuilt a custom tool that let engineering teams tap OpenAI's models for customer support, driver experience and internal productivity.Morgan Stanleyfirst embedded GPT-4 into workflows on its wealth management team and later extended the integration intoinvestment banking and trading. \"I see our responsibility as both building the tools and being, in some ways, the most knowledgeable people in the world on how to deploy them,\" Lightcap said. \"We've taken that seriously from day one.\" OpenAI's rollout doesn't rely on traditional sales reps. Instead, its go-to-market strategy leans heavily on engineers who work directly with enterprise partners to ensure the models solve real business problems. While playing a central role in global development for one of Silicon Valley's fastest-growing businesses, Lightcap also has to manage a sensitive relationship with OpenAI's closest partner and emerging rival,Microsoft. Microsoft is the lead investor in OpenAI, having poured roughly $13 billion into the company, and its primary cloud provider. OpenAI's models are tightly integrated into Microsoft products like Copilot, and the software giant has used its close ties with OpenAI to offer early access to tools before they're available on other clouds. The deeper OpenAI moves into enterprise sales, the more the two companies collide. For companies already running on Azure, Microsoft's pitch is the seamless integration that comes with adding OpenAI's models to the existing stack. But going directly through OpenAI offers proximity to the teams building the frontier technology. It's not the only market where they're going head-to-head. In Microsoft'sannual filinglast year, the company formally listed OpenAI as a competitor in search and news advertising. The disclosure landed days after OpenAI unveiled a prototype called SearchGPT, underscoring how quickly the two companies' interests were overlapping. And this week, Microsoft said it's startedpublicly testinga homegrown AI model called MAI-1-preview that could lead to enhancements to its Copilot assistant for consumers. Lightcap downplayed the rivalry. \"The opportunity space is so gigantic that in some sense, it's impossible not to bump into everyone else,\" he said. He emphasized that the key for OpenAI is the quality of its models, their safety and reliability, and how the company works with customers. Microsoft didn't respond to a request for comment. The two companies are now renegotiating the terms of their partnership, including the enterprise sales split, which delivers 80% of revenue to OpenAI when it owns the customer relationship. Other points of tension include OpenAI's work with different cloud providers and the governance system that will shape OpenAI's next stage of growth as itrai... [truncated]",
      "source": "https://www.cnbc.com/2025/08/31/openais-brad-lightcap-leads-global-expansion-pursuit-of-enterprise.html",
      "url": "https://www.cnbc.com/2025/08/31/openais-brad-lightcap-leads-global-expansion-pursuit-of-enterprise.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/08/31/openais-brad-lightcap-leads-global-expansion-pursuit-of-enterprise.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "92eeec16a8edb854b2d1f7a65ab48d7c",
      "exported_at": "2025-09-01T03:48:56.566720",
      "continuous_session": true
    },
    {
      "title": "Alibaba (BABA) June quarter 2025 earnings report",
      "link": "https://www.cnbc.com/2025/08/29/alibaba-baba-june-quarter-2025-earnings-report.html",
      "summary": "Alibaba posted a a revenue miss in the June quarter even as it showed an acceleration at its cloud computing unit.",
      "published": "Mon, 01 Sep 2025 07:30:42 GMT",
      "content": "In this article Alibabaposted a better-than-expected bottom line in the June quarter on Friday, fueled by accelerated sales at its cloud computing unit and a continued revival of its e-commerce business, sending shares higher. Still, the Chinese giant's revenues came in under analyst forecasts. U.S.-listed shares of the Chinese giant had gained nearly 13% on Friday after the company announced results. On Monday, Alibaba's Hong Kong-listed shares surged more than 19% before paring some gains. Here's how Alibaba did in its fiscal first quarter ended June, compared with LSEG estimates: Revenue rose 2% year-on-year, while the company's net income was up 78%. Alibaba attributed the increase in profit to gains in some of its equity investments and the disposal of Turkish e-commerce firm Trendyol. This was offset by a decrease in income from operations. However, excluding investment gains, Alibaba's net income would have decreased 18% year-on-year as it continues to invest in the cut-throat instant commerce space in China. Alibaba is carrying out a delicate balancing act between investing areas such as artificial intelligence and new e-commerce models, while showing that it can continue to grow in China's competitive market. So far, investors have rewarded Alibaba with a 40% rally in its U.S.-listed stock this year. That's partly thanks a continued growth acceleration at its key cloud computing division as well as improvements at both its China and international e-commerce businesses. Cloud computing was one of the bright spots. Alibaba said revenue at the division totaled 33.4 billion yuan, up 26% year-on-year. That was faster than the 18% growth rate seen in the previous quarter. Alibaba's cloud unit is seen as key to the company monetizing artificial intelligence, much like Microsoft or Google. \"Driven by robust AI demand, Cloud Intelligence Group experienced accelerated revenue growth, and AI-related product revenue is now a significant portion of revenue from external customers,\" Alibaba CEO Eddie Wu said in a statement. Investors are focused on Alibaba's investments in artificial intelligence, where it has become a major global player. The company hasaggressively launched various AI modelsand is selling services through its cloud computing division. While Alibaba has focused open source AI — meaning its models can be used for free and built on by developers — it also sells AI services through its cloud unit. Alibaba said AI-related product revenue \"maintained triple-digit year-over-year growth for the eighth consecutive quarter.\" Adjusted earnings before interest, taxes, and amortization (EBITA), a measure of profitability, jumped 26% year-on-year in the cloud unit. Alibaba is developing a new AI chipas it looks to build on growth in its cloud division, CNBC reported on Friday. The news of the chip, first reported by the Wall Street Journal, was also a driver behind Alibaba's share jump on Friday. Alibaba management said on Friday that the aim for the company is to keep the cloud growth rate above the market average, rather than to raise gross margins in the near term. Alibaba's core e-commerce business, which accounts for more than 50% of revenue, had mixed results. Overall, revenue rose 10% year-on-year to 19.6 billion yuan. Customer management revenue, which Alibaba makes off of selling marketing and other services to merchants on its platform, jumped 10%. CMR accounts for the bulk of e-commerce revenue. However, adjusted earnings in the division fell 21% in the quarter on an annual basis. That's because Alibaba has been investing heavily in so-called quick or instant commerce. This is a feature introduced on Taobao, one of Alibaba's main Chinese e-commerce apps, this year that provides deliveries of certain products in China within an hour Competition is intense in China, with rivals including food delivery giant Meituan and JD.com, all involved. And the rivalry is already taking its toll on some of these firms, with Meituan this weekpostingan 89% plunge in second-quarter adjusted net profit. Alibaba's own quick commerce division brought in revenue of more than 14.8 billion yuan, or $2 billion, rising 12% year-on-year. On an earnings call on Friday, the Alibaba management said instant commerce would add 1 trillion yuan in annualized incremental gross merchandise value (GMV) within the next three years. GMV is the amount of money transacted across Alibaba's platforms but does not translate into direct revenue. Still, investors appear okay with Alibaba's instant commerce investments, because its cloud computing business continues to grow, while its international online shopping unit — which includes AliExpress — saw a 19% jump in revenue in the quarter as losses narrowed. — CNBC's Amala Balakrishner contributed to this report.",
      "source": "https://www.cnbc.com/2025/08/29/alibaba-baba-june-quarter-2025-earnings-report.html",
      "url": "https://www.cnbc.com/2025/08/29/alibaba-baba-june-quarter-2025-earnings-report.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/08/29/alibaba-baba-june-quarter-2025-earnings-report.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "779b647e4e94afc8b00a90786ad3c70d",
      "exported_at": "2025-09-01T03:48:56.566725",
      "continuous_session": true
    },
    {
      "title": "European markets on Mon Sept.1: Stoxx 600, FTSE, DAX, data",
      "link": "https://www.cnbc.com/2025/09/01/european-markets-on-mon-septpoint1-stoxx-600-ftse-dax-data.html",
      "summary": "European stocks are expected to start the new trading week broadly higher on Monday.",
      "published": "Mon, 01 Sep 2025 07:29:40 GMT",
      "content": "LONDON — Shares of Danish pharmaceutical giantNovo Nordiskwere 3% higher in early deals Monday, after the company released trial data suggesting its blockbuster drug Wegovy outperforms major rivals in heart disease risk reduction. Thestudyfound continued users of semaglutide, a weight management drug branded as Wegovy, had up to a 57% greater reduction in the risk of heart attack, stroke or death than those using tirzepatide — the active ingredient in Zepbound and Mounjaro, the rival drugs produced by U.S. firmEli Lilly. The companies are the leading players in theincreasingly competitiveweight loss space, with investorscontinuing to assess study data on their key products. European stock markets were otherwise broadly higher Monday morning, with theStoxx 600index trading 0.25% higher at 8:20 a.m. in London (3:20 a.m. ET). It's a quiet day on the data front in Europe, although Turkish growth data and EU unemployment figures will be released. Regional stock markets closed lower last Friday as traders monitored European and U.S. inflation data and assessed the likelihood of the U.S. Federal Reserve cutting interest rates at its next meeting in September. Fed Chair Jerome Powell stoked expectations for a cut in aspeechwidely interpreted as dovish-tilting. The Fed next meets on Sept. 16-17. Meanwhile,Asia-Pacific marketstraded in mixed territory overnight as investors assessed China's RatingDog manufacturing data for August. The metric — previously known as the Caixin Purchasing Managers' Index — came in at 50.5, compared with a contraction of 49.5 the month before. Data released Sunday showed that the country's manufacturing PMI data came in at 49.4 in August, compared with 49.3 the month before. Investors are also assessing India-China relations after leaders from both countries agreed that they aredevelopment partners, not rivals, during a two-day meeting of the Shanghai Cooperation Organization regional security bloc. Chinese President Xi Jinping is expected to deliver a speech at the summit. U.S. financial markets are closed for the Labor Day public holiday on Monday. — CNBC's Amala Balakrishner contributed to this market report.",
      "source": "https://www.cnbc.com/2025/09/01/european-markets-on-mon-septpoint1-stoxx-600-ftse-dax-data.html",
      "url": "https://www.cnbc.com/2025/09/01/european-markets-on-mon-septpoint1-stoxx-600-ftse-dax-data.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/09/01/european-markets-on-mon-septpoint1-stoxx-600-ftse-dax-data.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "a06029052b0459b3e9e149640e41e4d0",
      "exported_at": "2025-09-01T03:48:56.566727",
      "continuous_session": true
    },
    {
      "title": "China's Xi urges AI cooperation, rejects ‘Cold War mentality’ at SCO summit",
      "link": "https://www.cnbc.com/2025/09/01/sco-summit-xi-ai-cooperation-reject-cold-war-mentality-putin-modi-china-india-russia.html",
      "summary": "It is unclear if the SCO summit will pave the way for any breakthroughs in easing tensions, though Beijing has sought to cast itself as a global peacemaker.",
      "published": "Mon, 01 Sep 2025 05:20:18 GMT",
      "content": "TIANJIN, China — Chinese PresidentXi Jinpingon Monday urged members of the Shanghai Cooperation Organization to strengthen artificial intelligence cooperation, while rejecting what he called a \"Cold War mentality.\" Xi was speaking at the largest-ever summit of the SCO to date, with more than 20 foreign leaders gathered in Tianjin, including Russian President Vladimir Putin and Indian Prime Minister Narendra Modi. The meeting comes as China seeks to cast itself as a global peacemaker, against a backdrop of persistent trade tensions with the United States, Russia's war in Ukraine and the Israel-Hamas conflict. Xi said China has invested $84 billion in other SCO countries and pledged support for 10,000 students to join Beijing's \"Luban\" vocational education program. He added that the SCO gathering presents an opportunity to chart a new phase of high-quality development and cooperation. Ahead of his remarks, Xi briefly gathered with Modi and Putin during a photo session with all SCO members. Xi is expected to meet with Putin this week, with the Russian leader scheduled to stay in China for a military parade in Beijing to commemorate 80 years since the end of World War II. Over the weekend, Xi met with at least 10 visiting leaders, including Turkey's President Recep Tayyip Erdogan and Cambodia's Prime Minister Hun Manet. On Saturday, he met Modi, with both sides affirming the importance of being partners, not rivals, according to official readouts. \"A stable relationship and cooperation between India and China and their 2.8 billion peoples on the basis of mutual respect, mutual interest and mutual sensitivity are necessary for the growth and development of the two countries,\" India's Ministry of Foreign Affairs said in a statement following the meeting. While it remains unclear if the SCO summit will pave the way for any breakthroughs in easing tensions, analysts said that China's détente with India could help strengthen Beijing's influence. \"The improvement of relations with India is a big deal. It allows India to access highly critical intellectual property that it needs if it is to industrialize and boost manufacturing,\" Marko Papic, chief strategist, GeoMacro Strategy BCA Access, said in an email. \"But, over the long term, the U.S. is losing the propaganda battle to paint China as the trouble-maker-in-chief. And that only further ossifies multipolarity,\" he said. China has taken some \"initiative\" for economic collaboration as well as peace, said Henry Huiyao Wang, founder and president of the Beijing-based think tank Center for China and Globalization. He also pointed to efforts by China and India to rebuild ties and said he hoped India and Pakistan would do the same. \"[U.S.] President Trump is trying to make a lot of peace, but I think with the help of China, we could do the same too,\" Wang said Monday on CNBC's \"The China Connection.\" \"China could take advantage of its good relations with Russia to help [broker] the deal for the Russian war in Ukraine,\" Wang said, adding that the SCO, or members like China and India, could act as a guarantor for security. The SCO summit could lead to China building better relations with a slew of countries, Papic said. The summit is expected to release a joint statement at the conclusion of the two-day meeting Monday. China's top diplomat Wang Yi is scheduled to hold a press conference Monday evening local time. — CNBC's Victoria Yeo contributed to this report",
      "source": "https://www.cnbc.com/2025/09/01/sco-summit-xi-ai-cooperation-reject-cold-war-mentality-putin-modi-china-india-russia.html",
      "url": "https://www.cnbc.com/2025/09/01/sco-summit-xi-ai-cooperation-reject-cold-war-mentality-putin-modi-china-india-russia.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/09/01/sco-summit-xi-ai-cooperation-reject-cold-war-mentality-putin-modi-china-india-russia.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "f11e0e124bdf8429deecd31a057db6d8",
      "exported_at": "2025-09-01T03:48:56.566729",
      "continuous_session": true
    },
    {
      "title": "Trump trade: Tariffs voided in court ruling",
      "link": "https://www.cnbc.com/2025/08/30/trump-trade-tariffs-appeals.html",
      "summary": "If the Supreme Court upholds the ruling, President Donald Trump would lose some, but not all, of his broad tariff powers.",
      "published": "Sat, 30 Aug 2025 19:25:45 GMT",
      "content": "PresidentDonald Trump'saggressive trade agenda hit a significant snag this week when a federal appeals court ruled that most of his \"reciprocal tariffs\" are illegal. TheU.S. Court of Appeals for the Federal CircuitheldFridaythat Trump overstepped his presidential authority when he imposed levies on virtually every country in the world as part of his April 2 \"liberation day\" announcement. Before court action, Trump's tariffs were set to affect roughly 69% of U.S. goods imports,according to the Tax Foundation. If struck down, the duties would impact just roughly 16%. The ruling injects a heavy dose of uncertainty into a central tenet of Trump's economic agenda, which has rattled the global economy since April. For now, the appeals court ruling states the duties on goods from most countries — as high as 50% for a few countries — will stay in effect untilOct. 14, to allow the Trump administration time to appeal the decision to the U.S. Supreme Court. The appeals court decision affects the \"reciprocal tariffs\" Trump announced on April 2, as well as levies he had previously imposed on Mexico, Canada and China. Trump cited the1977 International Emergency Economic Powers Actto justify his sweeping tariffs. He declared the United States'trade deficitwith other nations a national emergency, and invoked IEEPA to impose the steep levies. The appeals court ruled, however, that IEEPA does not give him authority to implement the tariffs, stating that power resides solely with Congress. \"The core Congressional power to impose taxes such as tariffs is vested exclusively in the legislative branch by the Constitution,\" the court said in its7-4 ruling. The ruling puts Trump's levies, which took effect earlier this month after multiple delays, on shaky ground. Trump imposed the tariffs on more than 60 countries, including a 50% rate on India and Brazil. He also imposed a 10% baseline tariff on most other countries that were not hit with a specified reciprocal tariff rate. The court also deemed Trump's tariffs on China, Canada and Mexico — which the administration claimed were necessary because the countries were not doing enough to curb the alleged trafficking of fentanyl into the U.S. — were illegal. Trump has said that he will appeal the ruling to the Supreme Court. \"If allowed to stand, this Decision would literally destroy the United States of America,\" hewroteon social media. If the high court ultimately determines that the tariffs are illegal, there are still other ways for Trump to implement levies, but the scope would likely be much more restricted. For instance, Trump could invoke the1974 Trade Act,but that law caps tariffs at 15% and only for 150 days, unless Congress extends them. Parts of Trump's agenda remain safe from the court decision. Most notably, his sector-specific levies on steel and aluminum remain unaffected by the appeals court's ruling. Earlier this month, the Trump administration expanded its 50%steel and aluminum tariffsto include more than 400 additional product categories, according to the Department of Commerce. Trump has relied on these sector-specific tariffs — often referred to as Section 232 tariffs — to bypass court proceedings. \"Section 232 tariffs are central to President Trump's tariff strategy,\" Mike Lowell, a partner at law firm Reed Smith,previously told CNBC. \"They aren't the target of the pending litigation, and they're more likely to survive a legal challenge and continue into the next presidential administration, which is what we saw with the aluminum and steel tariffs originally imposed under the first Trump administration,\" Lowell said. The Trump administration is reportedly planning to expand its sector-specific tariffs, including those on steel and aluminum, as a way of skirting the looming legal battles, according toThe Wall Street Journal. The tariffs that Trump imposed on China during his first term, which former PresidentJoe Bidenmaintained, are also likely to remain in place despite the appeals court ruling. Finally, the \"de minimis\" exemption wasofficially eliminated on Friday, so imports valued at $800 or less are now subject to tariffs and duties, another blow to small and medium-sized U.S. businesses, and a part of Trump's trade agenda that appears safe from court action.",
      "source": "https://www.cnbc.com/2025/08/30/trump-trade-tariffs-appeals.html",
      "url": "https://www.cnbc.com/2025/08/30/trump-trade-tariffs-appeals.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/08/30/trump-trade-tariffs-appeals.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "7339546aaab716b46e8f15762cea9cc8",
      "exported_at": "2025-09-01T03:48:56.566731",
      "continuous_session": true
    },
    {
      "title": "BYD’s Hong Kong shares fall nearly 8% after quarterly profit drop",
      "link": "https://www.cnbc.com/2025/09/01/byd-hong-kong-shares-fall-nearly-8percent-after-quarterly-profit-drop.html",
      "summary": "Hong Kong-listed shares of BYD fell more than 6% after the Tesla rival reported a quarterly profit drop amid a price war in its domestic industry.",
      "published": "Mon, 01 Sep 2025 04:28:09 GMT",
      "content": "Hong Kong-listed shares ofBYDslid nearly 8% Monday after the Chinese electric vehicle maker reported a sharp drop in quarterly profit amid an aggressive price war across its domestic industry. The Tesla rival on Friday reported net profit of 6.36 billion yuan ($891 million) for the April-June quarter, down about 30% from a year earlier, according to data from LSEG. The results came despite an expansion in overseas sales, which helped the company's revenue grow 14% year over year to about 201 billion yuan. BYD's profitability has been harmed by the breakout of yet another discount war in China last quarter — something that has become a common occurrence in the space. The company said inits mid-year earnings filingthat \"increased price competition and frequent occurrences of excessive marketing\" in China's EV space had \" exerted an adverse periodic impact on the development of the industry.\" Retail car prices in China have fallen by around 19% over the past two years to around 165,000 yuan ($22,900), according to arecent Nomura report, citing industry data from Autohome Research Institute. Weary of unfair competition, Chinese authorities in May warned they wouldpunish carmakersfor fueling price cuts. BYD's net profit for the first half of the year reached 15.5 billion yuan, up nearly 14%. The company's first-half revenue climbed about 23% to 371.3 billion yuan, with new energy vehicle sales hitting a record high. Chinese automakers, including BYD, have been expanding into new markets globally amid intense domestic competition.BYD has led that charge, opening showrooms across Europe and launching its cars at competitive prices over the last two years. In July, BYD recordedover 13,000 new registrationson the continent, up 225% annually, according to the European Automobile Manufacturers Association.",
      "source": "https://www.cnbc.com/2025/09/01/byd-hong-kong-shares-fall-nearly-8percent-after-quarterly-profit-drop.html",
      "url": "https://www.cnbc.com/2025/09/01/byd-hong-kong-shares-fall-nearly-8percent-after-quarterly-profit-drop.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/09/01/byd-hong-kong-shares-fall-nearly-8percent-after-quarterly-profit-drop.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "d74d3a3357005614f876074581107a22",
      "exported_at": "2025-09-01T03:48:56.566733",
      "continuous_session": true
    },
    {
      "title": "Bitcoin dominance could return in September as crypto traders await Fed decision",
      "link": "https://www.cnbc.com/2025/08/31/bitcoin-dominance-could-return-in-september-as-crypto-traders-await-fed-decision.html",
      "summary": "Bitcoin's performance this summer has been underwhelming versus ether, but investors suggest its dominance in crypto could come back in the month ahead.",
      "published": "Sun, 31 Aug 2025 11:30:06 GMT",
      "content": "Could not extract article content. The page may require JavaScript to load content.",
      "source": "https://www.cnbc.com/2025/08/31/bitcoin-dominance-could-return-in-september-as-crypto-traders-await-fed-decision.html",
      "url": "https://www.cnbc.com/2025/08/31/bitcoin-dominance-could-return-in-september-as-crypto-traders-await-fed-decision.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/08/31/bitcoin-dominance-could-return-in-september-as-crypto-traders-await-fed-decision.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "3be19a241b89d4a3d25aab3d6cfadedb",
      "exported_at": "2025-09-01T03:48:56.566734",
      "continuous_session": true
    },
    {
      "title": "Why Spain's stock market is booming — and what might come next",
      "link": "https://www.cnbc.com/2025/09/01/why-spains-stock-market-is-booming-and-what-might-come-next.html",
      "summary": "Spanish equities have outperformed their European peers this year — and all of Wall Street's major indexes.",
      "published": "Sun, 31 Aug 2025 23:10:10 GMT",
      "content": "Could not extract article content. The page may require JavaScript to load content.",
      "source": "https://www.cnbc.com/2025/09/01/why-spains-stock-market-is-booming-and-what-might-come-next.html",
      "url": "https://www.cnbc.com/2025/09/01/why-spains-stock-market-is-booming-and-what-might-come-next.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/09/01/why-spains-stock-market-is-booming-and-what-might-come-next.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "664fa46f6933db74496dd3008696480a",
      "exported_at": "2025-09-01T03:48:56.566736",
      "continuous_session": true
    },
    {
      "title": "Trump Federal Reserve board",
      "link": "https://www.cnbc.com/2025/08/30/heres-what-it-really-means-for-trump-to-get-control-of-the-federal-reserve-board.html",
      "summary": "Since taking office in January, Trump has placed the Fed directly in the crosshairs of executive power.",
      "published": "Sun, 31 Aug 2025 12:11:48 GMT",
      "content": "President Donald Trump's effort to sack Federal Reserve Governor Lisa Cook is about more than firing someone: It's a maneuver that, if successful, would mark a seismic shift for an institution that for ages had been considered above politics. Since taking office in January, Trump has placed the Fed directly in the crosshairs of executive power. He has berated central bankers for not lowering rates, threatened to remove ChairJerome Powell, and now has taken the unprecedented step of actually attempting to unseat Cook. From the president's perspective, he's looking to reform what has been an unpopular institution, often blamed for therunaway inflationthat hit the U.S. following the Covid pandemic. Trump sees lower interest rates as a pathway to manage the swelling federal debt while boosting a housing market that has been a counterweight to an otherwisegrowing economy. However, legal scholars as well as financial market experts and present and former Fed officials say Trump's moves not only threaten to make the Fed more political but also would undermine key pillars of the American financial system. \"We are on a road that is going to lead to the erosion of central bank independence,\" said Kathryn Judge, a professor at Columbia Law School. \"It would be incredibly costly for the long-term health of the economy for the Fed to lose the credibility that it has spent decades trying to build.\" Independence in the Fed's case is a term used to describe its freedom from outside political influence to determine monetary policy that is best for the U.S. economy. This is particularly the case if those decisions are unpopular, such as when the Federal Open Market Committee raises interest rates to bring down inflation. But there's more at stake than simply the level of the three rates the Fed controls. Should Trump get a majority of members on the board of governors to vote the way he wants — and the evidence right now, to be sure, is scant that he can ever achieve such a goal — it would give him access to key levers that control the economy as well as the nation's financial infrastructure. The seven-member Board of Governors, for instance, has regulatory and enforcement power over banks. Moreover, while the 12-member FOMC sets the key overnight funds interest rate, the governors alone establish the discount rate, used to find the present value of money, and the interest on reserve balances, which pays banks for storing their money at the Fed and also serves as a kind of guardrail for the funds rate. Finally, the board has control over the reappointments of the 12 regional bank presidents, with a slew of names coming up in 2026. Embedded within those responsibilities is the Fed's role in ensuring the integrity of the Treasury system and preserving a stable dollar. In other words, this is about more than just getting a rate cut in September. \"The most serious danger, I think, to people's being able to have confidence in the Fed board is what Trump is himself doing,\" said Robert Hockett, a professor at Cornell Law School. \"Because if Trump succeeds with this, then it suggests the Fed board is nothing but a rubber stamp. It just basically tells us that any nutjob who happens to get into the White House will be setting monetary policy henceforth.\" The effect, Hockett added, is that \"we can have the same kind of hyperinflations in the future that banana republics in Latin America have classically had when their dictators have set monetary policy, or that Turkey has experienced in recent years because its dictator has set monetary policy.\" For the administration's part, Trump's lieutenants largely say they believe in Fed independence but see the central bank as institution run amok that needs reigning in. However, the president has conceded he will litmus testnominees for board vacancieson their willingness to lower rates, and he in the past has advocated getting a say in the Fed's rate decisions among other measures that might be considered intrusions into the central bank's space. \"I don't think it's an undermining of Fed independence. I just think it's the fact the system needs a wholesale reevaluation and President Trump just does things unconventionally,\" said Joseph LaVorgna, a senior economist during the first Trump term and now counselor to Treasury Secretary Scott Bessent. \"There definitely has been mission creep on behalf of the Fed getting into climate change and issues of diversity and inclusion and things that certainly go well beyond their mandate.\" In fact, the notion that the Fed needs an overhaul has support on Wall Street. Mohamed El-Erian, the former Pimco executive and now chief economic advisor at Allianz, recently advocated that Powell step down as chair to avoid just the kind of battle over independence that is happening now. Moreover, he said the Fed's own policy mistakes helped precipitate the current battle. \"This is the exact world that I was worried about,\" El-Erian said Friday on CNBC. \"The Fed is vu... [truncated]",
      "source": "https://www.cnbc.com/2025/08/30/heres-what-it-really-means-for-trump-to-get-control-of-the-federal-reserve-board.html",
      "url": "https://www.cnbc.com/2025/08/30/heres-what-it-really-means-for-trump-to-get-control-of-the-federal-reserve-board.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/08/30/heres-what-it-really-means-for-trump-to-get-control-of-the-federal-reserve-board.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "ff984aba7bf883353d8be0d699b987e9",
      "exported_at": "2025-09-01T03:48:56.566738",
      "continuous_session": true
    },
    {
      "title": "Asia markets trade mixed after China's RatingDog manufacturing data",
      "link": "https://www.cnbc.com/2025/09/01/2025/09/01/asia-stock-markets-today-live-updates-nikkei-225-asx-200-kospi-hang-seng-csi-300-sensex-nifty-50.html",
      "summary": "Investors are also assessing the developments in India and China relations, after leaders from both countries agreed that they are development partners, not rivals.",
      "published": "Mon, 01 Sep 2025 04:51:14 GMT",
      "content": "Asia-Pacific markets traded mixed Monday as investors assessed China's RatingDog manufacturing data for August. The metric came in at 50.5, compared to a contraction of 49.5 the month before. Data released Sunday showed that the country's manufacturing PMI data came in at 49.4 in August, compared to 49.3 the month before. Investors are also assessing the developments in India and China relations, after leaders from both countries agreed that they aredevelopment partners, not rivals, during a two-day meeting of the Shanghai Cooperation Organization regional security bloc. In his opening remarks at the summit, Chinese President Xi Jinpingurged SCO membersto strengthen artificial intelligence cooperation, while rejecting what he called a \"Cold War mentality.\" Hong Kong'sHang Seng indexrose 1.77%, with gains led byAlibaba Group, which jumped 17.29%,Alibaba Health Information Technology, which advanced 6.41% andBOC Hong Kong Holdings, which surged 6.08%. Meanwhile, mainland China'sCSI 300ticked down 0.12% in choppy trade. In Japan, theNikkei 225pared losses to trade 1.7% lower. Losses were led by semiconductor makersAdvantest, which plunged 8.44%,Disco Corp, which declined 7.81% andSocionext, which dropped 6.45%. Meanwhile, Japan's broader Topix index lost 0.72%. Over in South Korea, theKospiindex fell 1.14%, while the small-cap Kosdaq lost 1.2%. Australia'sS&P/ASX 200benchmark retreated 0.68%. Over in India, the benchmarkNifty 50added 0.43%, while the BSE Sensex index moved up 0.4% Investors were also assessing a U.S.federal appeals court rulingthat most of U.S. President Donald Trump's \"reciprocal tariffs are illegal.\" TheU.S. Court of Appeals for the Federal Circuitruled onFridaythat Trump had overstepped his presidential authority by imposing levies on virtually every country in the world as part of his April 2 \"liberation day\" announcement. Over on Wall Street, stocks fell Friday as new inflation data showed rising prices were still a risk heading into the new month. The broad-basedS&P 500ended the day 0.64% lower at 6,460.26, but still scored its fourth winning month in a row. TheNasdaq Compositeshed 1.15% to finish at 21,455.55, while theDow Jones Industrial Averagelost 92.02 points, or 0.20%, to settle at 45,544.88. U.S. markets are closed Monday for the Labor Day public holiday. — CNBC's Sean Conlon and Brian Evans contributed to this report.",
      "source": "https://www.cnbc.com/2025/09/01/2025/09/01/asia-stock-markets-today-live-updates-nikkei-225-asx-200-kospi-hang-seng-csi-300-sensex-nifty-50.html",
      "url": "https://www.cnbc.com/2025/09/01/2025/09/01/asia-stock-markets-today-live-updates-nikkei-225-asx-200-kospi-hang-seng-csi-300-sensex-nifty-50.html",
      "rss_source": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "fetched_from": "https://www.cnbc.com/2025/09/01/2025/09/01/asia-stock-markets-today-live-updates-nikkei-225-asx-200-kospi-hang-seng-csi-300-sensex-nifty-50.html",
      "fetch_method": "rss_deep",
      "source_url": "https://search.cnbc.com/rs/search/combinedcms/view.xml?partnerId=wrss01&id=100003114",
      "hash": "a8d9ae826a4371ef0e6aeb8e4e240c7c",
      "exported_at": "2025-09-01T03:48:56.566739",
      "continuous_session": true
    }
  ]
}